Documents/МГС_ВозвратБаллоновОтКонтрагентов_.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МГС_ВозвратБаллоновОтКонтрагентов_</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МГС_ВыпускБаллонов_</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБаллоновВозвращено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКонтейнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемосдатчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Баллоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Баллон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБаллона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_ТипыБаллонов_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислятсяПоОтправочнымДокументам</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МГС_ВозвратБаллоновОтКонтрагентов_/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	//Если ДанныеЗаполнения<> Неопределено Тогда
	//	ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
	//	ЭтотОбъект.ДокументВыпуск = ДанныеЗаполнения;
	//КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр МГС_ВыпускБаллонов
	//Движения.МГС_ВыпускБаллонов.Записывать = Истина;
	//Для Каждого ТекСтрокаБаллоны Из Баллоны Цикл
	//	Движение = Движения.МГС_ВыпускБаллонов.Добавить();
	//	Движение.Период = Дата;
	//	Движение.Баллон = ТекСтрокаБаллоны.Баллон;
	//	//Движение.Партия = ТекСтрокаБаллоны.Партия;
	//	//Движение.Выпуск = ТекСтрокаБаллоны.Выпуск;
	//	Движение.Состояние =Перечисления.МГС_СостояниеБаллона.Возвращено;
	//	//	Движение.Номенклатура = Номенклатура;
	//КонецЦикла;

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Ссылка КАК Ссылка,
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.НомерСтроки КАК НомерСтроки,
	//	|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.ТипБаллона КАК ТипБаллона,
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Количество КАК Количество
		|ИЗ
		|	Документ.МГС_ВозвратБаллоновОтКонтрагентов.ДокументыОтгрузки КАК МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки
		|ГДЕ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Движения.МГС_БаллоныУКонтрагентов.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Движение = Движения.МГС_БаллоныУКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТипБаллона = ВыборкаДетальныеЗаписи.ТипБаллона;
	//	Движение.ДокументОтгрузки = ВыборкаДетальныеЗаписи.ДокументОтгрузки;
		Движение.Контрагент = Контрагент;
		Движение.Количество =ВыборкаДетальныеЗаписи.Количество;
	
	КонецЦикла;
	Движения.МГС_БаллоныУКонтрагентов.Записать();
	Движения.МГС_БаллоныУКонтрагентов.БлокироватьДляИзменения =  истина;
	
	
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.ТипБаллона КАК ТипБаллона
		|ПОМЕСТИТЬ ВТ_ОтгрузкаБаллоны
		|ИЗ
		|	Документ.МГС_ВозвратБаллоновОтКонтрагентов.ДокументыОтгрузки КАК МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки
		|ГДЕ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МГС_БаллоныУКонтрагентовОстатки.Организация КАК Организация,
		|	МГС_БаллоныУКонтрагентовОстатки.ТипБаллона КАК ТипБаллона,
		|	МГС_БаллоныУКонтрагентовОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	МГС_БаллоныУКонтрагентовОстатки.ТипБаллона.Представление КАК ТипБаллонаПредставление
		|ИЗ
		|	РегистрНакопления.МГС_БаллоныУКонтрагентов.Остатки(
		|			&Граница,
		|			ТипБаллона В
		|					(ВЫБРАТЬ
		|						ВТ_ОтгрузкаБаллоны.ТипБаллона
		|					ИЗ
		|						ВТ_ОтгрузкаБаллоны КАК ВТ_ОтгрузкаБаллоны)
		|				И Организация = &Организация
		|				И Контрагент = &Контрагент) КАК МГС_БаллоныУКонтрагентовОстатки
		|ГДЕ
		|	МГС_БаллоныУКонтрагентовОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//	Отказ =  истина;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Остаток по "+ ВыборкаДетальныеЗаписи.ТипБаллонаПредставление 
	//	+" стал отрицательным (" 	+ВыборкаДетальныеЗаписи.КоличествоОстаток +")" ;
	//	//Сообщение.Поле = "";
	//	//Сообщение.УстановитьДанные();
	//	Сообщение.Сообщить();
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	КоличествоБаллоновВозвращено = ДокументыОтгрузки.Итог("Количество");
КонецПроцедуры
